{
    "title": {
        "locales": {
            "en": {
                "title_short": "Welcome!",
                "title_short_nav": "About me",
                "title_long_prefix": "Hello...",
                "title_long": "I'm {{Herly Castillo!}}"
            },
            "es": {
                "title_short": "¡Saludos!",
                "title_short_nav": "Sobre mí",
                "title_long_prefix": "Hola...",
                "title_long": "Soy {{Herly Castillo!}}"
            }
        }
    },
    "articles": [
        {
            "id": 1,
            "component": "ArticleText",
            "locales": {
                "en": {"title": "{{A little bit}} about me..."},
                "es": {"title": "{{Un poco}} acerca de mi..."}
            },
            "settings": {
                "order_items_by": "id",
                "order_items_sort": "asc"
            },
            "items": [
                {
                    "id": 1,
                    "img": "images/pictures/avatar.png",
                    "faIcon": "fa-solid fa-laptop",
                    "faIconColors": {"bg": "", "fill": "", "fillLight": ""},
                    "locales": {
                        "es": {
                            "text": "<p>Desarrollador con experiencia en la creación de soluciones sólidas del lado del [[{{servidor}}]], orientadas a la eficiencia, escalabilidad y mantenimiento a largo plazo. Me especializo en el diseño e implementación de [[{{servicios, estructuras de datos organizadas y flujos de trabajo automatizados}}]] que optimizan la gestión de información. Tengo experiencia trabajando en [[{{entornos colaborativos con metodologías ágiles, manteniendo una comunicación fluida con áreas técnicas y no técnicas}}]]. Me adapto con rapidez a nuevas herramientas, lenguajes y desafíos, siempre enfocado en entregar productos funcionales y de alto impacto.</p>"
                        },
                        "en":{
                            "text":"<p>Developer with experience in building robust [[{{server-side}}]] solutions, focused on efficiency, scalability, and long-term maintainability. I specialize in the design and implementation of [[{{services, structured data architectures, and automated workflows}}]] that optimize information management. I have experience working in [[{{collaborative environments with agile methodologies, maintaining clear communication with both technical and non-technical teams}}]]. I quickly adapt to new tools, languages, and challenges, always focused on delivering functional, high-impact products.</p>"
                        }
                    }
                }
            ]
        }
    ]
}